; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v11 ?v7)
             (pred_10 ?v2 ?v9)
             (pred_11 ?v11 ?v9)
             (pred_6 ?v4 ?v11 )
	     (pred_4 ?v11)
             (pred_3 ?v6)
             (pred_2 ?v2)
             (pred_12 ?v9)
             (pred_1 ?v11)
             (pred_5 ?v2)
             (pred_7 ?v11)
             (pred_9 ))



(:action op_3
:parameters (?v13 ?v3 ?v8 ?v12)
:precondition (and (pred_3 ?v13) (pred_3 ?v3) (pred_2 ?v8) (pred_12 ?v12)
          (pred_8 ?v13 ?v3) (pred_10 ?v8 ?v12)
                   (pred_11 ?v3 ?v12) (pred_4 ?v13) 
                   (pred_1 ?v3) (pred_5 ?v8))
:effect (and  (pred_7 ?v3) (not (pred_1 ?v3))))


(:action op_2
:parameters (?v13 ?v10)
:precondition (and (pred_3 ?v13) (pred_3 ?v10)
               (pred_4 ?v13) (pred_8 ?v13 ?v10) (pred_7 ?v10))
:effect (and (pred_4 ?v10) (not (pred_4 ?v13))))

(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_3 ?v13) (pred_2 ?v8) 
                  (pred_4 ?v13) (pred_6 ?v8 ?v13) (pred_9 ))
:effect (and (pred_5 ?v8)
   (not (pred_6 ?v8 ?v13)) (not (pred_9 ))))


(:action op_5
:parameters (?v13 ?v1 ?v5)
:precondition (and (pred_3 ?v13) (pred_2 ?v1) (pred_2 ?v5)
                  (pred_4 ?v13) (pred_5 ?v5) (pred_6 ?v1 ?v13))
:effect (and (pred_5 ?v1) (pred_6 ?v5 ?v13)
        (not (pred_5 ?v5)) (not (pred_6 ?v1 ?v13))))

(:action op_4
:parameters (?v13 ?v8)
:precondition (and (pred_3 ?v13) (pred_2 ?v8) 
                  (pred_4 ?v13) (pred_5 ?v8))
:effect (and (pred_9 ) (pred_6 ?v8 ?v13) (not (pred_5 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_25 obj_23 obj_08 obj_19 obj_11 obj_21 obj_20 obj_27 obj_17 obj_03 obj_15 obj_13 obj_14 obj_06 obj_18 obj_04 obj_05 obj_26 obj_02 obj_10 obj_30 obj_01 obj_28 obj_22
    obj_24 obj_29
    obj_16 obj_09 obj_07
    )

    (:init
       (pred_9)

       (pred_3 obj_12)
       (pred_3 obj_25)
       (pred_3 obj_23)
       (pred_3 obj_08)
       (pred_3 obj_19)
       (pred_3 obj_11)
       (pred_3 obj_21)
       (pred_3 obj_20)
       (pred_3 obj_27)
       (pred_3 obj_17)
       (pred_3 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_13)
       (pred_3 obj_14)
       (pred_3 obj_06)
       (pred_3 obj_18)
       (pred_3 obj_04)
       (pred_3 obj_05)
       (pred_3 obj_26)
       (pred_3 obj_02)
       (pred_3 obj_10)
       (pred_3 obj_30)
       (pred_3 obj_01)
       (pred_3 obj_28)
       (pred_3 obj_22)
       (pred_12 obj_24)
       (pred_12 obj_29)
       (pred_2 obj_16)
       (pred_2 obj_09)
       (pred_2 obj_07)

       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_25)
       (pred_8 obj_25 obj_21)
       (pred_8 obj_25 obj_23)
       (pred_8 obj_25 obj_12)
       (pred_8 obj_23 obj_20)
       (pred_8 obj_23 obj_08)
       (pred_8 obj_23 obj_25)
       (pred_8 obj_08 obj_27)
       (pred_8 obj_08 obj_19)
       (pred_8 obj_08 obj_23)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_08)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_21)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_21 obj_15)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_21 obj_25)
       (pred_8 obj_21 obj_11)
       (pred_8 obj_20 obj_13)
       (pred_8 obj_20 obj_27)
       (pred_8 obj_20 obj_23)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_27 obj_14)
       (pred_8 obj_27 obj_17)
       (pred_8 obj_27 obj_08)
       (pred_8 obj_27 obj_20)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_17 obj_27)
       (pred_8 obj_03 obj_18)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_15 obj_13)
       (pred_8 obj_15 obj_21)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_20)
       (pred_8 obj_13 obj_15)
       (pred_8 obj_14 obj_26)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_27)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_03)
       (pred_8 obj_04 obj_30)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_05 obj_26)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_04)
       (pred_8 obj_26 obj_28)
       (pred_8 obj_26 obj_02)
       (pred_8 obj_26 obj_14)
       (pred_8 obj_26 obj_05)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_02 obj_26)
       (pred_8 obj_10 obj_30)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_30 obj_01)
       (pred_8 obj_30 obj_04)
       (pred_8 obj_30 obj_10)
       (pred_8 obj_01 obj_28)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_01 obj_30)
       (pred_8 obj_28 obj_22)
       (pred_8 obj_28 obj_26)
       (pred_8 obj_28 obj_01)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_28)
       (pred_1 obj_12)
       (pred_1 obj_11)
       (pred_1 obj_18)
       (pred_11  obj_12 obj_24)
       (pred_11  obj_11 obj_29)
       (pred_11  obj_18 obj_29)
       (pred_7 obj_25)
       (pred_7 obj_23)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_21)
       (pred_7 obj_20)
       (pred_7 obj_27)
       (pred_7 obj_17)
       (pred_7 obj_03)
       (pred_7 obj_15)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_26)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_30)
       (pred_7 obj_01)
       (pred_7 obj_28)
       (pred_7 obj_22)

       (pred_10  obj_16 obj_24)
       (pred_10  obj_09 obj_29)
       (pred_10  obj_07 obj_29)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_07 obj_19)
       (pred_4 obj_23)
    )

    (:goal (and
       (pred_6 obj_07 obj_25)
    ))
(:constraints
  (always (not (pred_4 obj_08)))
)
)

; plan
1. (op_2 obj_23 obj_25)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_25)
   goals met: 0 of 1
2. (op_2 obj_25 obj_21)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_21)
   goals met: 0 of 1
3. (op_1 obj_21 obj_09)
   deleted: (pred_6 obj_09 obj_21) (pred_9)
   added: (pred_5 obj_09)
   goals met: 0 of 1
4. (op_2 obj_21 obj_25)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_25)
   goals met: 0 of 1
5. (op_4 obj_25 obj_09)
   deleted: (pred_5 obj_09)
   added: (pred_9) (pred_6 obj_09 obj_25)
   goals met: 0 of 1
6. (op_2 obj_25 obj_23)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_23)
   goals met: 0 of 1
7. (op_2 obj_23 obj_20)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_20)
   goals met: 0 of 1
8. (op_2 obj_20 obj_27)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_27)
   goals met: 0 of 1
9. (op_2 obj_27 obj_17)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_17)
   goals met: 0 of 1
10. (op_2 obj_17 obj_19)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_19)
   goals met: 0 of 1
11. (op_1 obj_19 obj_07)
   deleted: (pred_6 obj_07 obj_19) (pred_9)
   added: (pred_5 obj_07)
   goals met: 0 of 1
12. (op_2 obj_19 obj_17)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_17)
   goals met: 0 of 1
13. (op_2 obj_17 obj_27)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_27)
   goals met: 0 of 1
14. (op_2 obj_27 obj_20)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_20)
   goals met: 0 of 1
15. (op_2 obj_20 obj_23)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_23)
   goals met: 0 of 1
16. (op_2 obj_23 obj_25)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_25)
   goals met: 0 of 1
17. (op_5 obj_25 obj_09 obj_07)
   deleted: (pred_5 obj_07) (pred_6 obj_09 obj_25)
   added: (pred_5 obj_09) (pred_6 obj_07 obj_25)
   goals met: 1 of 1
